artillery/scenarios/quarantined/projects_merge_requests_diffs_controller_show_html.yml
config:
  ensure:
    maxErrorRate: 1

  plugins:
    expect: {}

  phases:
    - duration: 2
      arrivalRate: 2
      rampTo: 20
      name: "Warm up"

    - duration: 10
      arrivalRate: 20
      name: "Load"

scenarios:
  - flow:
      - get:
          url: /{{PROJECT_GROUP}}/{{PROJECT_NAME}}/merge_requests/{{PROJECT_MR_COMMITS_IID}}/diffs.json
          expect:
            - statusCode: 200