artillery/scenarios/quarantined/projects_merge_requests_diffs_controller_show_html.yml
config:
  http:
    pool: 10

  plugins:
    expect: {}

  phases:
    - duration: 2
      arrivalRate: 2
      rampTo: 20
      name: "Warm up"

    - duration: 10
      arrivalRate: 20
      name: "Load"

scenarios:
  - flow:
      - get:
          url: /{{GITLABHQ_GROUP}}/{{GITLABHQ_PROJECT}}/merge_requests/{{GITLABHQ_MR_IID}}/diffs.json
          expect:
            - statusCode: 200